sites/myblog2/app/controllers/pages_controller.rb

  def index
  	@users = User.all
  	@posts = Post.all
---
SELECT "posts".* FROM "posts"